src/k-bench-results/kubeEdge/reliability-control/reliability-control-2/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1355.04          ---          ---        13.41232        12.28700        28.41500        46.59100       104.39 
Gets        13548.77         4.67     13544.10        13.40684        12.28700        28.41500        46.07900       527.92 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14903.81         4.67     13544.10        13.40734        12.28700        28.41500        46.07900       632.30 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.655        0.000
SET      10.687        5.000
SET      11.263       10.000
SET      11.455       15.000
SET      11.583       20.000
SET      11.711       25.000
SET      11.775       30.000
SET      11.903       35.000
SET      11.967       40.000
SET      12.095       45.000
SET      12.287       50.000
SET      12.351       52.500
SET      12.415       55.000
SET      12.479       57.500
SET      12.607       60.000
SET      12.671       62.500
SET      12.735       65.000
SET      12.863       67.500
SET      12.991       70.000
SET      13.119       72.500
SET      13.247       75.000
SET      13.311       76.250
SET      13.375       77.500
SET      13.503       78.750
SET      13.631       80.000
SET      13.823       81.250
SET      14.015       82.500
SET      14.207       83.750
SET      14.527       85.000
SET      14.975       86.250
SET      15.487       87.500
SET      15.807       88.125
SET      16.127       88.750
SET      16.639       89.375
SET      17.279       90.000
SET      18.175       90.625
SET      19.327       91.250
SET      20.479       91.875
SET      21.503       92.500
SET      22.143       93.125
SET      22.655       93.750
SET      22.783       94.062
SET      23.039       94.375
SET      23.167       94.688
SET      23.423       95.000
SET      23.551       95.312
SET      23.679       95.625
SET      23.935       95.938
SET      24.063       96.250
SET      24.319       96.562
SET      24.575       96.875
SET      24.703       97.031
SET      24.831       97.188
SET      25.087       97.344
SET      25.215       97.500
SET      25.343       97.656
SET      25.599       97.812
SET      25.727       97.969
SET      25.983       98.125
SET      26.239       98.281
SET      26.495       98.438
SET      26.623       98.516
SET      26.879       98.594
SET      27.007       98.672
SET      27.263       98.750
SET      27.519       98.828
SET      27.903       98.906
SET      28.287       98.984
SET      28.799       99.062
SET      29.439       99.141
SET      30.079       99.219
SET      30.591       99.258
SET      30.975       99.297
SET      31.487       99.336
SET      31.871       99.375
SET      32.511       99.414
SET      33.023       99.453
SET      33.791       99.492
SET      34.559       99.531
SET      35.327       99.570
SET      36.095       99.609
SET      36.607       99.629
SET      37.119       99.648
SET      37.631       99.668
SET      38.143       99.688
SET      38.655       99.707
SET      39.167       99.727
SET      39.935       99.746
SET      40.447       99.766
SET      41.215       99.785
SET      41.983       99.805
SET      42.239       99.814
SET      42.495       99.824
SET      43.007       99.834
SET      43.263       99.844
SET      43.775       99.854
SET      44.287       99.863
SET      44.799       99.873
SET      45.567       99.883
SET      46.079       99.893
SET      46.591       99.902
SET      46.847       99.907
SET      47.103       99.912
SET      47.359       99.917
SET      47.615       99.922
SET      48.127       99.927
SET      48.383       99.932
SET      48.895       99.937
SET      49.407       99.941
SET      49.919       99.946
SET      50.687       99.951
SET      50.943       99.954
SET      51.455       99.956
SET      51.711       99.958
SET      51.967       99.961
SET      52.479       99.963
SET      52.991       99.966
SET      53.503       99.968
SET      54.015       99.971
SET      54.783       99.973
SET      55.295       99.976
SET      55.807       99.977
SET      56.063       99.978
SET      56.575       99.979
SET      56.831       99.980
SET      57.087       99.982
SET      57.599       99.983
SET      58.111       99.984
SET      58.367       99.985
SET      58.879       99.987
SET      59.391       99.988
SET      59.647       99.988
SET      59.903       99.989
SET      59.903       99.990
SET      60.159       99.990
SET      60.415       99.991
SET      60.927       99.991
SET      61.183       99.992
SET      61.439       99.993
SET      61.695       99.993
SET      62.207       99.994
SET      62.463       99.994
SET      62.463       99.995
SET      62.719       99.995
SET      62.975       99.995
SET      62.975       99.995
SET      63.999       99.996
SET      64.255       99.996
SET      64.511       99.996
SET      64.767       99.997
SET      65.279       99.997
SET      65.279       99.997
SET      65.279       99.997
SET      65.535       99.997
SET      66.559       99.998
SET      67.071       99.998
SET      67.583       99.998
SET      68.607       99.998
SET      69.119       99.998
SET      69.119       99.998
SET      69.631       99.998
SET      70.655       99.999
SET      70.655       99.999
SET      71.167       99.999
SET      72.703       99.999
SET      72.703       99.999
SET      73.215       99.999
SET      73.215       99.999
SET      73.215       99.999
SET      73.727       99.999
SET      73.727       99.999
SET      75.263       99.999
SET      75.263       99.999
SET      75.263       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      76.287      100.000
SET      76.799      100.000
SET      76.799      100.000
SET      76.799      100.000
SET      79.871      100.000
SET      79.871      100.000
SET      79.871      100.000
[...]
SET      81.407      100.000
SET      81.407      100.000
SET      81.407      100.000
[...]
SET      95.231      100.000
SET      95.231      100.000
---
GET       1.599        0.000
GET      10.687        5.000
GET      11.263       10.000
GET      11.455       15.000
GET      11.583       20.000
GET      11.647       25.000
GET      11.775       30.000
GET      11.903       35.000
GET      11.967       40.000
GET      12.095       45.000
GET      12.287       50.000
GET      12.351       52.500
GET      12.415       55.000
GET      12.479       57.500
GET      12.543       60.000
GET      12.671       62.500
GET      12.735       65.000
GET      12.863       67.500
GET      12.991       70.000
GET      13.055       72.500
GET      13.247       75.000
GET      13.311       76.250
GET      13.375       77.500
GET      13.503       78.750
GET      13.631       80.000
GET      13.759       81.250
GET      13.951       82.500
GET      14.207       83.750
GET      14.527       85.000
GET      14.911       86.250
GET      15.423       87.500
GET      15.743       88.125
GET      16.127       88.750
GET      16.639       89.375
GET      17.279       90.000
GET      18.175       90.625
GET      19.327       91.250
GET      20.479       91.875
GET      21.375       92.500
GET      22.143       93.125
GET      22.655       93.750
GET      22.783       94.062
GET      23.039       94.375
GET      23.167       94.688
GET      23.295       95.000
GET      23.551       95.312
GET      23.679       95.625
GET      23.935       95.938
GET      24.063       96.250
GET      24.319       96.562
GET      24.575       96.875
GET      24.703       97.031
GET      24.831       97.188
GET      24.959       97.344
GET      25.215       97.500
GET      25.343       97.656
GET      25.471       97.812
GET      25.727       97.969
GET      25.983       98.125
GET      26.239       98.281
GET      26.495       98.438
GET      26.623       98.516
GET      26.879       98.594
GET      27.007       98.672
GET      27.263       98.750
GET      27.519       98.828
GET      27.903       98.906
GET      28.287       98.984
GET      28.799       99.062
GET      29.439       99.141
GET      30.207       99.219
GET      30.591       99.258
GET      30.975       99.297
GET      31.487       99.336
GET      31.999       99.375
GET      32.511       99.414
GET      33.279       99.453
GET      33.791       99.492
GET      34.559       99.531
GET      35.327       99.570
GET      36.351       99.609
GET      36.863       99.629
GET      37.119       99.648
GET      37.631       99.668
GET      38.143       99.688
GET      38.911       99.707
GET      39.423       99.727
GET      39.935       99.746
GET      40.447       99.766
GET      41.215       99.785
GET      41.983       99.805
GET      42.239       99.814
GET      42.495       99.824
GET      43.007       99.834
GET      43.263       99.844
GET      43.775       99.854
GET      44.031       99.863
GET      44.543       99.873
GET      45.055       99.883
GET      45.567       99.893
GET      46.335       99.902
GET      46.591       99.907
GET      46.847       99.912
GET      47.359       99.917
GET      47.615       99.922
GET      48.127       99.927
GET      48.383       99.932
GET      48.895       99.937
GET      49.407       99.941
GET      49.919       99.946
GET      50.687       99.951
GET      50.943       99.954
GET      51.199       99.956
GET      51.711       99.958
GET      51.967       99.961
GET      52.479       99.963
GET      52.991       99.966
GET      53.247       99.968
GET      53.759       99.971
GET      54.527       99.973
GET      55.039       99.976
GET      55.295       99.977
GET      55.551       99.978
GET      56.063       99.979
GET      56.319       99.980
GET      56.575       99.982
GET      57.087       99.983
GET      57.599       99.984
GET      58.111       99.985
GET      58.623       99.987
GET      59.135       99.988
GET      59.391       99.988
GET      59.647       99.989
GET      59.903       99.990
GET      60.415       99.990
GET      60.927       99.991
GET      61.183       99.991
GET      61.695       99.992
GET      62.207       99.993
GET      62.719       99.993
GET      63.231       99.994
GET      63.487       99.994
GET      63.999       99.995
GET      64.511       99.995
GET      64.767       99.995
GET      65.023       99.995
GET      65.535       99.996
GET      66.047       99.996
GET      66.047       99.996
GET      66.559       99.997
GET      67.071       99.997
GET      67.583       99.997
GET      68.095       99.997
GET      68.095       99.997
GET      68.607       99.998
GET      69.119       99.998
GET      70.143       99.998
GET      70.655       99.998
GET      70.655       99.998
GET      71.167       99.998
GET      71.679       99.998
GET      72.191       99.999
GET      72.191       99.999
GET      72.703       99.999
GET      73.215       99.999
GET      73.727       99.999
GET      74.239       99.999
GET      74.751       99.999
GET      75.263       99.999
GET      76.287       99.999
GET      76.799       99.999
GET      76.799       99.999
GET      77.311       99.999
GET      77.311       99.999
GET      77.823       99.999
GET      77.823       99.999
GET      78.335       99.999
GET      78.335      100.000
GET      78.335      100.000
GET      78.847      100.000
GET      79.359      100.000
GET      79.359      100.000
GET      79.871      100.000
GET      79.871      100.000
GET      79.871      100.000
[...]
GET      80.383      100.000
GET      80.383      100.000
GET      80.383      100.000
[...]
GET      80.895      100.000
GET      81.407      100.000
GET      81.407      100.000
GET      81.407      100.000
GET      81.919      100.000
GET      82.431      100.000
GET      83.455      100.000
GET      83.455      100.000
GET      83.455      100.000
[...]
GET      83.967      100.000
GET      83.967      100.000
GET      83.967      100.000
GET      92.671      100.000
GET      92.671      100.000
GET      93.183      100.000
GET      93.183      100.000
GET      93.183      100.000
[...]
GET      93.695      100.000
GET      93.695      100.000
GET      93.695      100.000
[...]
GET      94.207      100.000
GET      94.207      100.000
GET      94.207      100.000
[...]
GET      95.743      100.000
GET      95.743      100.000
---
WAIT      0.000      100.000